Notes/daily/2021-11-22.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2021-11-22</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">

<div class="header">
    <span class="title">2021-11-22</span>
    <div class="links">
        <a href="/">Home</a>
        <a href="/Notes/daily/2022-01-23.html">Latest daily</a>
        <a href="https://github.com/Minion3665/EPQ/issues/new">Report issue</a>
        <a href="https://github.com/Minion3665/EPQ">View source</a>
    </div>
</div>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org79e571b">Diary entry</a>
<ul>
<li><a href="#orgb384566">What have I done since the last entry?</a></li>
<li><a href="#org0645d43">What have I learned &amp; how?</a></li>
<li><a href="#org8ce928e">What worked well?</a></li>
<li><a href="#org340a642">What would I do differently next time?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org79e571b" class="outline-2">
<h2 id="org79e571b">Diary entry</h2>
<div class="outline-text-2" id="text-org79e571b">
</div>
<div id="outline-container-orgb384566" class="outline-3">
<h3 id="orgb384566">What have I done since the last entry?</h3>
<div class="outline-text-3" id="text-orgb384566">
<ul class="org-ul">
<li>I've made the build system use the harvard 'cite them right' system of referencing to automatically reference my sources in the correct format based on <a href="file:///home/runner/School/EPQ/Documents/bibliography.html">my bibliography file</a></li>
<li>I've <a href="file:///home/runner/School/EPQ/Notes/20211029093544-what_exactly_is_containerd.html">researched what containerd is</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0645d43" class="outline-3">
<h3 id="org0645d43">What have I learned &amp; how?</h3>
<div class="outline-text-3" id="text-org0645d43">
<ul class="org-ul">
<li>I've learned a little more lisp, including the difference between <code>'</code> and <code>`</code></li>
<li>I've learned how different citation styles work, including that 'there is no single, definitive version of Harvard Style'(Modesto Junior College, 2021) (hey look, I did it!)</li>
<li>I've learned some essential bits of information about containerd, including but not limited to the fact that it is almost certainly the right tool for the job, but that it will need to be tethered with other tools to provide features such as network support. This means I'll likely have to adjust my timeline (and it's why I left a few extra months in the original)</li>
</ul>
</div>
</div>
<div id="outline-container-org8ce928e" class="outline-3">
<h3 id="org8ce928e">What worked well?</h3>
<div class="outline-text-3" id="text-org8ce928e">
<ul class="org-ul">
<li>The citing worked really well in today's research; and I'm very happy with how much time it saved me</li>
</ul>
</div>
</div>
<div id="outline-container-org340a642" class="outline-3">
<h3 id="org340a642">What would I do differently next time?</h3>
<div class="outline-text-3" id="text-org340a642">
<ul class="org-ul">
<li>I feel like I spent a long time implementing the citation style change, and while it was important a less-precise format probably could have worked</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
